function [Bmag, dB] = Bmag_orb(t,u)

global incl F

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%считаем радиус-вектор (единичный) аппарата
%орбита - круговая
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
r_sat=[cos(u) cos(incl)*sin(u) sin(incl)*sin(u)]';

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%матрица перехода от системы, связанной с орбитой, к орбитальной
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
G=[cos(u) -sin(u) 0;
sin(u) cos(u) 0;
0 0 1;];

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%задаем магнитное поле - наклонный диполь
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Bmag=Inclined_field(t,r_sat);

%перевод ИСК Земли - ИСК орбиты - орбитальная - связанная
Bmag=G*F'*Bmag;
dB=Bmag;
Bmag=[Bmag(2);Bmag(3);Bmag(1)];
end

