%тензор инерции
global J Jreal
%параметры орбиты
global w02 w0 incl F p
%начальный момент времени
global t0scal
%параметры модели магнитного поля
global B0 k0
%перевод градусов в радианы
global DEG_TO_RAD
%кинетический момент маховика
global h_wheel

DEG_TO_RAD=pi/180;

%маховик
h_wheel=[0 ;0.0; 0];

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%тензор инерции
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%"идеальный" тензор инерции из ТЗ - используется в модели движения в ФК
J=zeros(3,3);
% J(1,1)=3.600;
% J(2,2)=5.836;
% J(3,3)=2.468;
J(1,1)=0.01;
J(2,2)=0.01;
J(3,3)=0.007;
%"реальный" тензор инерции с неточностью 10 процентов - используется в моделировании
%ручная настройка
% Jreal=zeros(3,3);
% Jreal(1,1)=5836;
% Jreal(2,2)=2468;
% Jreal(3,3)=3600;
%случайная добавка, но один из моментов инерции обязательно изменятеся не
%менее чем на 10%
add=normrnd(zeros(3,1),ones(3,1));
add=.1*add/max(abs(add));
% Jreal=zeros(3,3);
% % Jreal(1,1)=(1+add(1))*J(1,1);
% % Jreal(2,2)=(1+add(2))*J(2,2);
% % Jreal(3,3)=(1+add(3))*J(3,3);
% Jreal(1,1)=(0.9)*J(1,1);
% % Jreal(2,2)=(0.9)*J(2,2);
% Jreal(3,3)=(0.9)*J(3,3);
% Jreal(2,2)=Jreal(3,3)+Jreal(1,1)-0.1;
%нормальное распределение
% Jreal=normrnd(J,.1*J/3)
%тензор известен точно
Jreal=J;

% if (Jreal(1,1)+Jreal(2,2)<Jreal(3,3))||(Jreal(3,3)+Jreal(2,2)<Jreal(1,1))||(Jreal(3,3)+Jreal(1,1)<Jreal(2,2))
%     break
% end 
% Jreal
 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%параметры орбиты
%высота орбиты и средний радиус Земли
% H=750;
H=340;
% H=8000;
r_earth=6371;
r = r_earth+H;
%наклонение
incl = 60*pi/180;
%долгота восходящего узла и аргумент перицентра
Omega0=0;
omega=0;
%начальный аргумент широты
u0=0;
%параметр орбиты
p=r;
%орбитальная скорость определяется по высоте
w02=(398600.4415/r^3)^.5;
w0=[0;w02;0];
%матрица перехода от инерциальной, связанной с орбитой,
%к инерциальной, связанной с Землей
F(1,1)=cos(Omega0)*cos(omega)-sin(Omega0)*sin(omega)*cos(incl);
F(1,2)=-cos(Omega0)*sin(omega)-sin(Omega0)*cos(omega)*cos(incl);
F(1,3)=sin(Omega0)*sin(incl);
F(2,1)=sin(Omega0)*cos(omega)+cos(Omega0)*sin(omega)*cos(incl);
F(2,2)=-sin(Omega0)*sin(omega)+cos(Omega0)*cos(omega)*cos(incl);
F(2,3)=-cos(Omega0)*sin(incl);
F(3,1)=sin(omega)*sin(incl);
F(3,2)=cos(omega)*sin(incl);
F(3,3)=cos(incl);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%параметры наклонного диполя
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%"величина"
mu=7.812e6;
B0=mu/p^3;
%углы ориентации диполя относительно Земли
lambda0=-71.88*DEG_TO_RAD;
delta0=10.26*DEG_TO_RAD;
%единичный вектор диполя относительно Земли
k0(1)=cos(lambda0)*sin(delta0);
k0(2)=sin(lambda0)*sin(delta0);
k0(3)=cos(delta0);

%%%%%%%%%%%%%%%%%%%%%%%
%начальный момент времени
t0 = [2015 1 1 0 0 0];
%переводим в скаляр
t0scal=datenum(t0);
%%%%%%%%%%%%%%%%%%%%%%%