%глобальные переменные и параметры для управления

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%параметры ПД-регулятора
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

global kw ka
% kw=3e4/w02;
% ka=1e4;
kw=40/w02;
ka=10;

% kw=3e4/w02/2;
% ka=1e4/2;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%демпфирование
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% global kw
% kw=5e6;
%поле в первый момент времени для алгоритма Bdot
%global Bprev
% Bmag=Inclined_field(0,[1 0 0]');
% Bmag=F'*Bmag;
% Bprev = A*Bmag;